
SCRIPT = [
#1
'''Привет!
Если ты из 2023 и тебе не больше 15 лет нажми "да" и начнется твой квест!😃
''',
#2
[
    '''Меня зовут Юми-о-7, я ученый и работаю в Корпорации Артефактов, в 2345 году. ''',
    '''Пишу вам с надеждой на вашу помощь! 
Дело в том, что я был отправлен на задание в прошлое, в день 
9 июля 2023 года. ''',
    '''Мне нужно было достать важные для ученых артефакты. Но я узнал, что когда я вернусь в свое время, меня будут ждать ПЛОХИЕ. Это бандиты, которые не хотят, чтобы люди жили мирно и хорошо. ОНИ отберут у меня артефакты. И если я не смогу их победить, то задание будет правалено. 
Если все понятно нажми "далее".'''
],
#3
[
    '''Если вы получили это письмо, то прошу вас - помогите мне выполнить задание!

Нужно отправить артефакты из вашего времени в будущее "своим ходом", ведь у вас пока не работают порталы времени.

Я всё продумал. ''',
    '''Вы должны подготовить 4 посылки.
По моим подсчетам предметы спокойно смогут пролежать следующие 322 года, если их правильно упаковать! 

Верю, что вы поможете мне, и ХОРОШИЕ победят!

Жми "готовы помочь"!'''
],
#4
'''Для начала наденьте одинаковые футболки. В третьем ящике голубого комода.''',
#5
['''В нашем времени отсутствуют много элементов, которые есть у вас. 
Для первого шага достань пластиковую бутылку и алюминиевую банку. Но обязательно новые. Купи в магазине.''',
'''Нельзя покупать всё в одном магазине. Надо запутать следы. 
Алюминиевую банку купи в местном маленьком магазине. А пластиковую бутылку найди в палатке с квасом.
Нажми кнопку "купили"'''
],
#6
'''Банка и бутылка- это контейнеры для отправки артефактов в будущее. Их надо опустошить и вымыть.
Нажми "готово"''',
#7
'''Нам потребуется охотничьи спички. Можно купить в любом туристическом магазине. 
Будем создавать вакуум, чтобы артефакты не испортились за 300 лет.''',
#8
'''Нам нужны пряности! 
Например: укроп, петрушка, лук, хрен. 
Если найдешь всё - отлично!!!

Жми "Есть"''',
#9
'''Давайте упакуем пряности. 
Возьми аллюминиевую банку.
Помести пряности внутрь.
Зажги спичку и поместт внутрь банки. Плотно закрой пластилиновой пробкой. 
Замотай скотчем.''',
#10
'''Теперь нам нужны цветы!

Chamomile
Cichórium
Philadélphus
Lupinus

Жми "приготовили"!''',
#11
'''Давай упакуем цветы. Возьми пустую пластиковую бутылку.
Помести цветы внутрь.
Зажги спичку.
Помести её внутрь вместе с огнём.
Закрой плотно крышку.''',
#12
['''Нам нужны металлы:

Вольфрам 
Свинец

''',
'''Вольфрам есть в ваших лампочках. 
Купите в магазине электрики. Обязательно в коробочке. 
Чтобы упаковать её для отправки в будущее сделайте следующее:
Упакуйте в вату.
Вату купите в аптеке. 
Затем положите в коробку и замотайте скотчем!

Нажми "готово"'''
],
#13
['''Найдите символ советского союза-звезду. Спросите об этом у взрослых, которые жили во времена советского союза. 
Вы должны сделать копию этой звезды.''',
'''Найдите подходящий грунт. Вдавите в него звезду так, чтобы рисунок отпечатался чётко.''',
'''Расплавьте в железной банке свинец на огне. И аккуратно вылейте в получившуюся в грунте форму.
Свинец можно найти в автомагазине. В отделе легковых запчастей.''',

'''Чтобы упаковать получившуюся копию в будущее возьмите крышечку, поместите туда свинцовую звезду, залейте клеем из клеевого пистолета.'''
],
#14
'''Настало время отправлять посылки.
Первую посылку-пластиковую бутылку с цветами отнеси в медицинскую лабораторию. Дверь будет для тебя открыта. Положи посылку там, где есть цветы и пластиковая бутылка.''',
#15
'''Вторую посылку - свинцовую звёздочку - отнеси туда, где вы брали свинец.''',
#16
'''Третью посылку примет Светлана, она находится на втором этаже в автомастерской, где меняют стёкла и красят машины. Поднимись по внешней лестнице и
отдай ей алюминиевую банку с пряностями.''',
#17
'''Последняя, четвёртая посылка будет принята на автозаправочной станции "Газпром". 
Ищите Любовь.
Если всё выполнено верно, то вы получите сюрприз.'''
]